---
title: FloorType
classe: Autodesk.Revit.DB.FloorType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.HostObjAttributes
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FloorType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsFoundationSlab { get; }` | `floorType.IsFoundationSlab` | Boolean |
| `ElementId StructuralMaterialId { get; set; }` | `floorType.StructuralMaterialId` | ElementId |
| `ThermalProperties ThermalProperties { get; }` | `floorType.ThermalProperties` | ThermalProperties |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```